#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = "Добавлен новый документ.";
		Уведомление.Записать();
	Иначе
		АдресФото = ПолучитьНавигационнуюСсылку( Объект.Ссылка , "ДанныеФото");
	КонецЕсли;

КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если СтрНайти(АдресФото, "Документ.ВКМ_ОбслуживаниеКлиента.ДанныеФото") > 0 Тогда
		ДвоичныеДанныеХранилища = ТекущийОбъект.ДанныеФото.Получить();
	Иначе	
		Если ЗначениеЗаполнено(АдресФото) Тогда 
			ДвоичныеДанныеХранилища = ПолучитьИзВременногоХранилища(АдресФото);
		Иначе
			ДвоичныеДанныеХранилища = Неопределено;
		КонецЕсли;		 	
	КонецЕсли;
	
	ТекущийОбъект.ДанныеФото = Новый ХранилищеЗначения(ДвоичныеДанныеХранилища);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СпециалистПриИзменении(Элемент)
	
	Текст = СтрШаблон("Изменился специалист: %1, для документа номер: %2", 
						Объект.Специалист, Объект.Номер);
	ДобавитьУведомление(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяОкончанияРаботПриИзменении(Элемент)
	
	Текст = СтрШаблон("Изменилось время окончания работ: %1, для документа номер: %2", 
						Формат(Объект.ВремяОкончанияРабот,"ДЛФ=T;"), Объект.Номер);
	ДобавитьУведомление(Текст);

КонецПроцедуры

&НаКлиенте
Процедура ВремяНачалаРаботПриИзменении(Элемент)
	
	Текст = СтрШаблон("Изменилось время начала работ: %1, для документа номер: %2",
						Формат(Объект.ВремяНачалаРабот, "ДЛФ=T;"), Объект.Номер);
	ДобавитьУведомление(Текст);

КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Текст = СтрШаблон("Изменилась дата проведения работ: %1, для документа номер: %2", 
						Формат(Объект.Дата,"ДФ=dd.MM.yyyy;"), Объект.Номер);
	ДобавитьУведомление(Текст);

КонецПроцедуры


&НаКлиенте
Процедура ФотоВыполненойРаботыНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытия.ПолноеИмяФайла = "";
	ДиалогОткрытия.Фильтр = "Изображение (*.png; *.jpg; *.jpeg)|*.png;*.jpg;*.jpeg)";
	ДиалогОткрытия.МножественныйВыбор = Ложь;
	ДиалогОткрытия.Заголовок = "Выберите файл";
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗагрузкиФайла", ЭтотОбъект);
	ДиалогОткрытия.Показать(ОписаниеОповещения);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьУведомление(ТекстСообшенияТелеграм)
		
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Уведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		Уведомление.ТекстСообщения = ТекстСообшенияТелеграм;
		Уведомление.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗагрузкиФайла(ВыбранныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйФайл = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещенияОЗавршении = Новый ОписаниеОповещения("ПослеПомещенияФайла", ЭтотОбъект);
	
	//@skip-check bsl-legacy-check-static-feature-access
	НачатьПомещениеФайла(ОписаниеОповещенияОЗавршении, , ВыбранныйФайл[0], Ложь, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ПослеПомещенияФайла(Результат, Адрес, ПутьКФайлу, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	АдресФото = Адрес;
	
	Модифицированность = Истина;
	
КонецПроцедуры

#КонецОбласти