#Область ПрограммныйИнтерфейс	
	
// Процедура отправляет сообщение в Телеграм.
//
//  Параметры:
//   ТекстСообщения - Строка - Строка.
//
Процедура ОтправитьСообщение(ТекстСообщения) Экспорт
		
	// устанавливаем соединение с сервером
	Попытка
		Соединение = Новый HTTPСоединение("api.telegram.org", , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	Исключение
		Сообщение = Новый СообщениеПользователю();
 		Сообщение.Текст = "Не удалось установить соединение с сервером онлайн-проверки:" 
        					+ Символы.ПС + ИнформацияОбОшибке().Описание;
		Сообщение.Сообщить();
	КонецПопытки;
				
	Токен = Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить();
	НомерГруппы = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Запрос = Новый HTTPЗапрос("/bot" + Токен + "/sendMessage");
	Запрос.Заголовки.Вставить("Content-Type", "application/json");
		
	ДанныеОтвета = Новый Структура;
	ДанныеОтвета.Вставить("chat_id", НомерГруппы);
	ДанныеОтвета.Вставить("text", ТекстСообщения);
	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON(ДанныеОтвета));
		
	Попытка 
		//@skip-check bsl-legacy-check-dynamic-feature-access
		Ответ = Соединение.ОтправитьДляОбработки(Запрос);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
	КонецПопытки;
			
	Если Ответ.КодСостояния <> 200 Тогда
			
		//ОшибкаПодробно = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке);
		ОшибкаПодробно = ИнформацияОбОшибке.Описание;
		
		ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка,,,
		ОшибкаПодробно);
			
	КонецЕсли;
							 
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Преобразуем некую Структуру в JSON
// Возвращаемое значение Строка
//
// Параметры:
// ОбъектJSON - Структура - Структура объекта
//
// Возвращаемое значение:
// Строка
Функция СтрокаJSON(ОбъектJSON) Экспорт
		
	ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(,Символы.Таб,,,,,,,);
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку(ПараметрыЗаписи);
	ЗаписатьJSON(Запись, ОбъектJSON);
		
	Возврат Запись.Закрыть();
		
КонецФункции
	
#КонецОбласти
