
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура КонтрольДнейПревышения(Команда)
	КонтрольДнейПревышенияНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура АнализГрафика(Команда) 
	
	АдресДанных = ВыгрузитьГрафикОтпусков();//Неопределено; // Будут данные запроса
	
	ПараметрыФормы = Новый Структура("АдресДанных", АдресДанных);
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы);
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ВыгрузитьГрафикОтпусков()
	
	ДанныеДокумента = Объект.ОтпускаСотрудников.Выгрузить();
	
	Результат = ПоместитьВоВременноеХранилище(ДанныеДокумента, УникальныйИдентификатор);
	
	Возврат Результат;
КонецФункции

&НаСервере
Процедура КонтрольДнейПревышенияНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	СУММА(РАЗНОСТЬДАТ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала,
		|		ДОБАВИТЬКДАТЕ(ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания, ДЕНЬ, 1), ДЕНЬ)) КАК КоличествоВсего
		|ПОМЕСТИТЬ ВТ_Дни
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.НомерСтроки КАК НомерСтроки,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник КАК Сотрудник,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаНачала КАК ДатаНачала,
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.ДатаОкончания КАК ДатаОкончания,
		|	ВТ_Дни.КоличествоВсего КАК КоличествоВсего
		|ИЗ
		|	Документ.ВКМ_ГрафикОтпусков.ОтпускаСотрудников КАК ВКМ_ГрафикОтпусковОтпускаСотрудников
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Дни КАК ВТ_Дни
		|		ПО ВКМ_ГрафикОтпусковОтпускаСотрудников.Сотрудник = ВТ_Дни.Сотрудник
		|ГДЕ
		|	ВКМ_ГрафикОтпусковОтпускаСотрудников.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		СтрокаТаблицы = Объект.ОтпускаСотрудников[Выборка.НомерСтроки - 1];
		СтрокаТаблицы.ОбщееКоличествоДней = Выборка.КоличествоВсего;
		
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
