#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	// регистр ВКМ_ВыполненныеКлиентуРаботы
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	
	// регистр ВКМ_ВыполненыеСотрудникомРаботы
	Движения.ВКМ_ВыполненыеСотрудникомРаботы.Записывать = Истина;
		
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка КАК Ссылка,
		|	СУММА(ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту
		|ПОМЕСТИТЬ ВТ_Док
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента.ВыполненныеРаботы КАК ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка = &Ссылка
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОбслуживаниеКлиентаВыполненныеРаботы.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВТ_Док.ЧасыКОплатеКлиенту КАК ЧасыКОплатеКлиенту,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ВидДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ДатаНачалаДоговора,
		|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ДатаОкончанияДоговора,
		|	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	ВТ_Док КАК ВТ_Док
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|			ПО ВКМ_ОбслуживаниеКлиента.Договор = ДоговорыКонтрагентов.Ссылка
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата,) КАК
		|				ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|			ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|		ПО ВТ_Док.Ссылка = ВКМ_ОбслуживаниеКлиента.Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Дата", Дата);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживние Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Указан не верный вид договора!";
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Дата < Выборка.ДатаНачалаДоговора ИЛИ Дата > Выборка.ДатаОкончанияДоговора Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Дата документа не лежит между насчалом: %1 и окончанием: %2 договора", 
											Выборка.ДатаНачалаДоговора, Выборка.ДатаОкончанияДоговора);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Возврат;
			
		КонецЕсли;
		
		Если Выборка.ПроцентОтРабот = Null Тогда
			
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Для Сотрудника %1 Не указан процент от работ!", Выборка.Специалист);
			Сообщение.Сообщить();
			
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
		Движение.Период = Дата;
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Клиент = Клиент;
		Движение.Договор = Договор;
		Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
		Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРаботы;
		
		Если Выборка.ПроцентОтРабот = 0 Тогда
			КоэффициентРаботы = 0;
		Иначе
			КоэффициентРаботы = Выборка.ПроцентОтРабот / 100;
		КонецЕсли;
		
		ДвижениеСотрудникомРабот = Движения.ВКМ_ВыполненыеСотрудникомРаботы.Добавить();
		ДвижениеСотрудникомРабот.Период = Дата;
		ДвижениеСотрудникомРабот.Сортудник = Выборка.Специалист;
		ДвижениеСотрудникомРабот.ЧасовКОплате = Выборка.ЧасыКОплатеКлиенту;
		ДвижениеСотрудникомРабот.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРаботы * КоэффициентРаботы;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли

