Функция СозданиеАктов(ДанныеПериода) Экспорт
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
		// Данный фрагмент построен конструктором.
		// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ДоговорыКонтрагентов.Код КАК Код,
			|	ДоговорыКонтрагентов.Наименование КАК Наименование,
			|	ДоговорыКонтрагентов.Владелец КАК Владелец,
			|	ДоговорыКонтрагентов.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
			|	ДоговорыКонтрагентов.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
			|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
			|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
			|	ДоговорыКонтрагентов.Организация КАК Организация
			|ПОМЕСТИТЬ ВТ_Договора
			|ИЗ
			|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
			|ГДЕ
			|	ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
			|	И ДоговорыКонтрагентов.ВКМ_ДатаНачала <= &ДатаНачала
			|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончания >= &ДатаОкончания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	РеализацияТоваровУслуг.Ссылка КАК Ссылка,
			|	РеализацияТоваровУслуг.Дата КАК Дата,
			|	РеализацияТоваровУслуг.Договор КАК Договор,
			|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
			|	РеализацияТоваровУслуг.Организация КАК Организация
			|ПОМЕСТИТЬ ВТ_Рализация
			|ИЗ
			|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
			|ГДЕ
			|	РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_Договора.Ссылка КАК СсылкаДоговор,
			|	ВТ_Договора.Владелец КАК Владелец,
			|	ВТ_Договора.ВКМ_ДатаНачала КАК ВКМ_ДатаНачала,
			|	ВТ_Договора.ВКМ_ДатаОкончания КАК ВКМ_ДатаОкончания,
			|	ВТ_Договора.ВКМ_СуммаАбонентскойПлаты КАК ВКМ_СуммаАбонентскойПлаты,
			|	ВТ_Договора.Организация КАК Организация,
			|	ВТ_Рализация.Ссылка КАК СсылкаРеализации
			|ИЗ
			|	ВТ_Договора КАК ВТ_Договора
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Рализация КАК ВТ_Рализация
			|		ПО ВТ_Договора.Ссылка = ВТ_Рализация.Договор
			|		И ВТ_Рализация.Контрагент = ВТ_Договора.Владелец
			|		И ВТ_Рализация.Организация = ВТ_Договора.Организация";
		
		Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживние);
		Запрос.УстановитьПараметр("ДатаОкончания", ДанныеПериода.ДатаОкончания);
		Запрос.УстановитьПараметр("ДатаНачала", ДанныеПериода.ДатаНачала);
				
		Выборка = Запрос.Выполнить().Выбрать();
		
		Результат = Новый Массив();
		
		Пока Выборка.Следующий() Цикл
			
			ДанныеРеализации = Новый Структура;
			ДанныеРеализации.Вставить("СсылкаДоговор", Выборка.СсылкаДоговор);
			
			Если Не ЗначениеЗаполнено(Выборка.СсылкаРеализации) Тогда
				
				НоваяРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
				НоваяРеализация.Заполнить(Выборка.СсылкаДоговор);
				НоваяРеализация.Дата = ДанныеПериода.ДатаОкончания;
				НоваяРеализация.Записать();
				НоваяРеализация.ВыполнитьАвтозаполнение();
				
				ТекущаяСссылка = НоваяРеализация.Ссылка;
			Иначе
				ТекущаяСссылка = Выборка.СсылкаРеализации;
				//ДанныеРеализации.Вставить("СсылкаРеализации", );									
			КонецЕсли;
			
			ДанныеРеализации.Вставить("СсылкаРеализации", ТекущаяСссылка);
			
			ТекущийОбъект = ТекущаяСссылка.ПолучитьОбъект();
			ТекущийОбъект.Записать(РежимЗаписиДокумента.Проведение);
		
			Результат.Добавить(ДанныеРеализации);
			
		КонецЦикла;
		
		//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА	
	//ДлительныеОперации.СообщитьПрогресс(, "Что-то обрабатывается");
	
	Возврат Результат;
	
КонецФункции