
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура КатегорияПерсоналаПриИзменении(Элемент)
	КатегорияПерсоналаПриИзмененииНаСервере();
КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура КатегорияПерсоналаПриИзмененииНаСервере()
	
	Запись.Оклад = 0;
	
	Если Запись.КатегорияПерсонала = Перечисления.ВКМ_КатегорииПерсонала.Специалисты Тогда
		
		МинимальныйОклад = Константы.ВКМ_МинимальныйОклад.Получить();
		
		Если МинимальныйОклад = Неопределено Тогда
			ОбщегоНазначения.СообщитьПользователю("Минимальный оклад не указан!");
		Иначе 
			Запись.Оклад = Константы.ВКМ_МинимальныйОклад.Получить();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти
