#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//+++ Яковлев Д.В.
	ВидимостьЭлементовДляАбонентскогоОбслуживания();
	//---
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//+++ Яковлев Д.В.
	ГруппаАбонентскойПлаты = Элементы.Добавить("ГруппаАбонентскаяПлата", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаАбонентскойПлаты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаАбонентскойПлаты.ОтображатьЗаголовок = Ложь;
	ГруппаАбонентскойПлаты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	
	ГруппаДаты = Элементы.Добавить("ГруппаДата", Тип("ГруппаФормы"), ГруппаАбонентскойПлаты);
	ГруппаДаты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаДаты.ОтображатьЗаголовок = Ложь;
	ГруппаДаты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеРеквезитДатаНачала = Элементы.Добавить("ДатаНачала", Тип("ПолеФормы"), ГруппаДаты);
	ПолеРеквезитДатаНачала.Вид = ВидПоляФормы.ПолеВвода;
	ПолеРеквезитДатаНачала.ПутьКДанным = "Объект.ВКМ_ДатаНачала";
	
	ПолеРеквезитДатаОкончания = Элементы.Добавить("ДатаОкончания", Тип("ПолеФормы"), ГруппаДаты);
	ПолеРеквезитДатаОкончания.Вид = ВидПоляФормы.ПолеВвода;
	ПолеРеквезитДатаОкончания.ПутьКДанным = "Объект.ВКМ_ДатаОкончания";
	
	ПолеРеквезитСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), ГруппаАбонентскойПлаты);
	ПолеРеквезитСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	ПолеРеквезитСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ПолеРеквезитСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), ГруппаАбонентскойПлаты);
	ПолеРеквезитСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	ПолеРеквезитСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	//---
	
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	//+++ Яковлев Д.В.
	ВидимостьЭлементовДляАбонентскогоОбслуживания();
	//---
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьЭлементовДляАбонентскогоОбслуживания()
	
	//+++ Яковлев Д.В.
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскоеОбслуживние Тогда
		
		Элементы.ГруппаАбонентскаяПлата.Видимость = Истина;
		Элементы.ГруппаДата.Видимость = Истина;
			
	Иначе
		
		Элементы.ГруппаАбонентскаяПлата.Видимость = Ложь;
		Элементы.ГруппаДата.Видимость = Ложь;
			
	КонецЕсли;
	//---
	
КонецПроцедуры

#КонецОбласти

