
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	
	ВыполнитьОбработку();
	
	Соообщение = Новый СообщениеПользователю;
	Соообщение.Текст = "Обработка завершена!";
	Соообщение.Сообщить();
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни, Объект.ГрафикРаботы);
КонецПроцедуры
#КонецОбласти 
