
#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ОбработкаУведомлений() Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ВКМ_ОбработкаУведомлений);
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения,
		|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту
		|ГДЕ
		|	ВКМ_УведомленияТелеграмБоту.ПометкаУдаления = ЛОЖЬ";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Попытка
			ВКМ_Телеграм.ОтправитьСообщение(Выборка.ТекстСообщения);
			СообщениеОтправлено = Истина;
		Исключение
			СообщениеОтправлено = Ложь;
		КонецПопытки;
		
		Если СообщениеОтправлено Тогда
			
			Уведомление = Выборка.Ссылка;
			ОбъектУведомление = Уведомление.ПолучитьОбъект();
			ОбъектУведомление.Удалить();
			
		КонецЕсли;

	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти