
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	АдресДанныхОтпусков = Параметры.АдресДанных;
	
	Диаграмма.Очистить();
	
	ГрафикиОтпусков = ПолучитьИзВременногоХранилища(АдресДанныхОтпусков);
	
	Для Каждого СтрокаГрафика Из ГрафикиОтпусков Цикл
	//В цикле
	Точка = Диаграмма.УстановитьТочку(СтрокаГрафика.Сотрудник);
	Точка.Текст = СтрокаГрафика.Сотрудник.Наименование;
	
	Серия = Диаграмма.УстановитьСерию("");
	Серия.Текст = "Отпуск";
	
	Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
	
	Интервал = Значение.Добавить();
	Интервал.Начало = СтрокаГрафика.ДатаНачала;
	Интервал.Конец = СтрокаГрафика.ДатаОкончания;
	
	КонецЦикла;
	
КонецПроцедуры
#КонецОбласти
