
&НаСервере
Функция СформироватьАктыНаСервере(ДанныеПериода)
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
				"Обработки.ВКМ_МассовоеСозданиеАктов.СозданиеАктов", ДанныеПериода);
		
	Возврат ДлительнаяОперация;
	
КонецФункции

&НаКлиенте
Процедура СформироватьАкты(Команда)
	
	ДлительнаяОперация = СформироватьАктыНаСервере(Объект.Период);
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;
	//ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры) Экспорт
	
	ПолученныйРезультат = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Если Результат.Статус = "Ошибка" Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки);
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Для Каждого СтрокаРезультата из ПолученныйРезультат Цикл
			
			НоваяСтрока = Объект.СписокДоговоров.Добавить();
			НоваяСтрока.Договор = СтрокаРезультата.СсылкаДоговор;
			НоваяСтрока.Реализация = СтрокаРезультата.СсылкаРеализации;		
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры